１、ブランチを切る
    master branchが最新かを確認
    9,pullから始める
２、開発
３、add
    チェック入れる動作＝indexにあげる
    どのファイルを追加するかを選択
４、commit
    セーブする
５、push(何commit単位でまとめても良い)
    pushボタン　→今作ったブランチ(ローカル)にあげる。
    masterにpushすることはほぼない。
    compare and pull request のアラートが出る　→そこ押す
    差分のみを送ってくれる
    どのブランチに入れたかが重要
６、pull request(確認依頼)
    チャットルームみたいな。
    タイムライン的になっとる。
    ここでコンフリクトを起こす可能性あり
７、確認(github上/ローカル上)
８、マージ　merge (ブランチの統合)
９、pull(ローカルのマスターをリモートのマスターと合わせる) 



conflict work
１、どっちが先にmergeまでするかを決める
２、どのファイルを同時にいじるかを決める
３、解決しよう